# рекурсия

# def foo():
#     print("У попа была собака, он ее любил.")
#     ("Она съела кусок мяса, он ее убил,")
#     ("В землю закопал и надпись написал:")
#     foo()
#
# foo()

##################################################################################

# факториал

# def factorial (n):
#     if n == 0:
#         return 1
#     else:
#         return n * factorial(n - 1)
#
# print(factorial(5))



##################################################################################

# фибоначи


# fib = lambda n: fib(n - 1) + fib(n - 2) if n > 2 else 1

def fib (n):
    if n > 2:
        return fib(n - 1) + fib(n - 2)
    else:
        return 1

print(fib(5))
