# filter map apply reduce

array = [-10,-9,-8,-7,-6,-5,-4,-3,-2,-1,0,1,2,3,4,5,6,7,8,9,10]


# new_array = filter(lambda x: x > 0, array)
#
# print(list(new_array))


# new_array = [i for i in array if i > 0]
#
# print(new_array)

# ЗАДАНИЕ
# написать функцию, которая на вход принимает массив и возвращает массив чисел, которые делятся на два


###########################################################################



# практика




##########################################################################


# new_array = map(lambda x: x * x, array)
#
# print(list(new_array))




###########################################################################

# list1 = [7, 2, 3, 10, 12]
# list2 = [-1, 1, -5, 4, 6]
#
# new_array = map(lambda x, y: x*y, list1, list2)
#
# print(list(new_array))


###########################################################################


# практика

###########################################################################
